/* ==========================================
   PUBLIC BOOTH — DATABASE
   ========================================== */

/*
  CITIES:
  [name, latitude, longitude, total]

  LOCATIONS:
  Individual photobooths with exact coordinates.

  Add future booths ONLY to PUBLIC_BOOTH_LOCATIONS.
*/

/* WORLD CITIES */

window.PUBLIC_BOOTH_CITIES = [
  ['Москва', 55.7558, 37.6173, 25],
  ['Санкт-Петербург', 59.9343, 30.3351, 26],
  ['Воронеж', 51.6608, 39.2003, 1],
  ['Ессентуки', 44.0445, 42.8589, 1],
  ['Саратов', 51.5336, 46.0343, 2],
  ['Пятигорск', 44.0486, 43.0594, 1],
  ['Челябинск', 55.1644, 61.4368, 2],
  ['Омск', 54.9885, 73.3242, 1],
  ['Кемерово', 55.3552, 86.0873, 1],
  ['Тула', 54.193, 37.6175, 1],
  ['Краснодар', 45.0355, 38.9753, 2],
  ['Пермь', 58.0105, 56.2502, 4],
  ['Красноярск', 56.0153, 92.8932, 1],
  ['Сургут', 61.254, 73.3962, 1],
  ['Нижний Новгород', 56.3269, 44.0059, 1],
  ['Новокузнецк', 53.7575, 87.136, 2],
  ['Зеленоград', 55.9825, 37.1811, 2],
  ['Казань', 55.7961, 49.1064, 3],
  ['Самара', 53.1959, 50.1008, 3],
  ['Набережные Челны', 55.7436, 52.3958, 1],
  ['Новосибирск', 55.0084, 82.9357, 3],
  ['Уфа', 54.7388, 55.9721, 3],
  ['Ростов-на-Дону', 47.2357, 39.7015, 2],
  ['Екатеринбург', 56.8389, 60.6057, 4],
  ['Иркутск', 52.2869, 104.305, 3],
  ['Сочи', 43.5855, 39.7231, 3],
  ['Байкальск', 51.5158, 104.14, 1],

  ['Hollywood', 34.1016, -118.3409, 1],
  ['Las Vegas', 36.1699, -115.1398, 1],
  ['Columbia', 39.2037, -76.861, 1],
  ['Albany', 42.6526, -73.7562, 1],
  ['Staten Island', 40.5795, -74.1502, 1],

  ['Ереван', 40.1792, 44.4991, 2],
  ['Белград', 44.7866, 20.4489, 3],
  ['Дубай', 25.2048, 55.2708, 11],
  ['Ташкент', 41.2995, 69.2401, 8],
  ['Стамбул', 41.0082, 28.9784, 4],
];

/* EXACT PHOTOBOOTHS */

window.PUBLIC_BOOTH_LOCATIONS = [
  {
    id: 'msk-001',
    name: 'Цветной',
    city: 'Москва',
    country: 'Россия',

    lat: 55.771145,
    lng: 37.620177,

    address: 'Цветной бульвар, 15, стр. 1',
    floor: '',
    image: '',

    // Optional verified GeoJSON Polygon geometry.
    // null = attempt automatic OSM lookup.
    buildingPolygon: null,

    status: 'active',
  },

  /*
  ADD NEXT BOOTH LIKE THIS:

  ,{
    id: "msk-002",
    name: "Авиапарк",
    city: "Москва",
    country: "Россия",

    lat: null,
    lng: null,

    address: "Ходынский бульвар, 4",
    floor: "",
    image: "",

    buildingPolygon: null,
    status: "active"
  }
  */
];
